# GetDatumSlabComponent

## Description
Gets the datum slab component of an object.

```pascal
FUNCTION GetDatumSlabComponent(obj : HANDLE): INTEGER;
```

```python
def vs.GetDatumSlabComponent(obj):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|obj|HANDLE|The object. Can be a slab, Slab Style, or the Slab Preferences.|

## See Also
VS Functions:
SetDatumSlabComponent

## Version
Availability: from Vectorworks 2011

## Category
* Objects - Architectural